Autodesk.Navisworks.Api.Point3DList
List of 3D points.

Autodesk.Navisworks.Api.Point3DList.#ctor
Creates an empty list

Autodesk.Navisworks.Api.Point3DList.Add(Autodesk.Navisworks.Api.Point3D)
Adds a point to the back of the list
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.Point3DList.IsReadOnly
Gets a value indicating whether the object is read-only.